{
  "information": {
    "name": "Clyde James Felix",
    "contact": {
      "phone": "(808)546-9976",
      "email": "felixclyde@gmail.com",
      "linkedin": "linkedin.com/in/felixclyde",
      "github": "github.com/cjfelixx"
    }
  },
    "education": [
      {
        "university": "UNIVERSITY OF HAWAII AT MANOA",
        "college": "College of Engineering",
        "start_date": "Aug 2020",
        "end_date": "Aug 2021",
        "degree": " Master of Science (M.S.) in Electrical and Computer Engineering (Systems and Data Science)"
      },
      {
        "university": "UNIVERSITY OF HAWAII AT MANOA",
        "college": "College of Engineering",
        "start_date": "Aug 2016",
        "end_date": "May 2020",
        "degree": " Bachelor of Science (B.S.) in Electrical Engineering",
        "leadership": [
          "Institute of Electrical and Electronics Engineers (IEEE) Student Hawai’i Branch (Webmaster)",
          "Engineers’ Council at UH (VP of Information Technology)"
        ]
      }
    ],
    "work_experiences": [
      {
        "position": "SOFTWARE ENGINEER",
        "company": "DataHouse Consulting, Inc.",
        "start_date": "Jun 2021",
        "end_date": "Present",
        "responsibilities": [
          "Spearheaded the development of 3 AWS-based applications as Backend Lead and Tech Lead using JavaScript/TypeScript, and Python, ensuring secure, scalable, and highly available in development and production workloads.",
          "Maintained a high level of professional communication, facilitating seamless interactions with project managers, clients, business analysts, and fellow developers, ultimately fostering a collaborative environment that enhanced project quality and client satisfaction.",
          "Utilized Jira to track and prioritize software development tasks while adhering to Agile methodologies."
        ]
      },
      {
        "position": "TEACHING ASSISTANT",
        "company": "University of Hawaii (UH) at Manoa Department of Electrical Engineering",
        "start_date": "Jan 2020",
        "end_date": "Dec 2021",
        "responsibilities": [
          "Assisted around 10-30 undergraduate students in conducting experiments using Python and MATLAB.",
          "Courses: Linear Algebra/Machine Learning(EE 345), Communication System(EE 343), Microelectronic Circuits I(EE 323), Digital Signal Processing(EE 415)."
        ]
      },
      {
        "position": "GRADUATE RESEARCH ASSISTANT",
        "company": "University of Hawaii (UH) at Manoa Department of Electrical Engineering",
        "start_date": "Jul 2020",
        "end_date": "Feb 2021",
        "responsibilities": [
          "Conducted independent research on Medical Imaging using Deep Learning and Computer Vision.",
          "Developed an iterative Neural Network to improve model performance of the MRI image reconstruction using Linux, Matlab, and Pytorch."
        ]
      },
      {
        "position": "SOFTWARE ENGINEER INTERN",
        "company": "Alohapay, Inc.",
        "start_date": "Mar 2020",
        "end_date": "May 2020",
        "responsibilities": [
          "Developed Python test scripts utilizing Selenium to evaluate the performance of the AlohaPass mobile application.",
          "Generated and revised documentation related to the application, as well as reports detailing testing outcomes."
        ]
      },
      {
        "position": "UNDERGRADUATE RESEARCH ASSISTANT",
        "company": "University of Hawaii (UH) at Manoa Department of Mathematics",
        "start_date": "Jun 2019",
        "end_date": "Aug 2019",
        "responsibilities": [
          "Collaborated with 3 students on providing mathematical simulations on automatic complexities of Fibonacci/Tribonacci words and VC-dimensions using Python and Jupyter Notebook.",
          "Contributed to an accepted ISAIM publication and Undergraduate Research Program presentation."
        ]
      },
      {
        "position": "MACHINE LEARNING RESEARCH INTERN",
        "company": "Tokyo University of Agriculture & Technology",
        "start_date": "Jul 2019",
        "end_date": "Aug 2019",
        "responsibilities": [
          "Designed a MATLAB code of a Brain-Computer Interface system that classifies the mental states of an individual.",
          "Successfully determined a Motor Imagery setting that benefits stroke rehabilitation around 5% increase in accuracy."
        ]
      }
    ],
    "technical_skills": {
      "languages": ["Python", "MATLAB", "Javascript", "Typescript", "HTML/CSS"],
      "tools": ["Jira/Confluence", "Git(Github/Gitlab)", "Linux", "DBeaver", "Visual Studio Code", "Figma", "Postman"],
      "frameworks_libraries": ["Node", "Deno", "Express", "React", "React Native", "Angular", "Next"],
      "machine_learning": ["Pytorch", "Tensorflow", "Scikit-learn", "Pandas", "Numpy", "Jupyter"],
      "database": ["SQL(MSSQL,Postgresql)", "MongoDB"],
      "cloud_platforms": ["Amazon Web Services (AWS)", "Google Cloud Platform (GCP)"]
    },
    "projects": [
      {
        "project": "Federated Learning using Online-Kernel Methods",
        "description": ["Simulated Online Federated Learning using iterative least-squares algorithms, and kernel methods using Python.",
        "Wrote an accepted publication on Personalized Learning using kernel approximations on Random Fourier Features."]
      },
      {
        "project": "Reinforcement Learning on an Asymmetric Strategic game",
        "description": ["Led 5-10 undergraduate students in developing a strategy board game Goats & Tigers using Python.",
        "Implemented Reinforcement Learning to research computer behavior using Keras/Tensorflow, and Jupyter."]
      },
      {
        "project": "Workspace Hoteling application",
        "description": ["Developed a mobile-responsive workspace reservation web application utilizing the MERN stack (MongoDB, Express, React, Node).",
        "Leveraged AWS services such as EC2, RDS, Cognito, ECS, and CloudFront to deploy web applications for production use."]
      },
      {
        "project": "Portfolio web application as an LLM chatbot",
        "description": ["Developed a dynamic and interactive portfolio website leveraging the Next Typescript framework, enhancing user engagement with a modern and responsive design",
        "Innovatively implemented a chatbot powered by ChatGPT Large Language Model (LLM) using the Retrieval Augmented Generation (RAG) architecture, enabling users to pose questions about my resume data directly on the website."]
      }
    ]
  }
  